In [1]:
import pandas as pd
import numpy as np

# Pandas

In [55]:
dados = np.arange(25).reshape((5,5))
dados

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [61]:
pd.DataFrame(dados, index='A B C D E'.split(), columns='Coluna1 Coluna2 Coluna3 Coluna4 Coluna5'.split())

   Coluna1  Coluna2  Coluna3  Coluna4  Coluna5
A        0        1        2        3        4
B        5        6        7        8        9
C       10       11       12       13       14
D       15       16       17       18       19
E       20       21       22       23       24

In [64]:
dados2 = np.array([72, 180, 26, 80, 170, 19, 60, 165, 15]).reshape(3,3)

In [67]:
df = pd.DataFrame(dados2, columns='Peso Altura Idade'.split())

In [69]:
df

   Peso  Altura  Idade
0    72     180     26
1    80     170     19
2    60     165     15

### Segundo Método de criação: Dicionário de listas

In [72]:
dados = {
    'Peso':[72, 80, 60],
    'Altura':[180, 170, 165],
    'Idade':[26, 19, 15]
}

In [74]:
df_dict = pd.DataFrame(dados)

In [76]:
df_dict

   Peso  Altura  Idade
0    72     180     26
1    80     170     19
2    60     165     15

### Terceiro método de criação: Lista de dicionários
Cada item será uma linha da tabela

In [78]:
dados = [
    {'Peso':72, 'Altura': 180, 'Idade':26},
    {'Peso':80, 'Altura': 170, 'Idade':19},
    {'Peso':60, 'Altura': 165, 'Idade':15}
]

In [79]:
df_lista = pd.DataFrame(dados)

In [80]:
df_lista

   Peso  Altura  Idade
0    72     180     26
1    80     170     19
2    60     165     15

### Acessando dataframe

In [87]:
df[['Peso', 'Altura']]

   Peso  Altura
0    72     180
1    80     170
2    60     165

In [89]:
df['Peso'][0]

72

In [98]:
df.loc[0]

Peso       72
Altura    180
Idade      26
Name: 0, dtype: int32

In [99]:
df.loc[0, 'Peso']

72

In [106]:
list(df.index)

[0, 1, 2]

In [112]:
df.iloc[0, 1]

180

In [114]:
df.iloc[:2]

   Peso  Altura  Idade
0    72     180     26
1    80     170     19

### Criando novas colunas

In [120]:
df['IMC'] = df['Peso'] / (df['Altura'] / 100) ** 2

In [121]:
df

   Peso  Altura  Idade        IMC
0    72     180     26  22.222222
1    80     170     19  27.681661
2    60     165     15  22.038567

In [128]:
df['Classificação'] = pd.Series(['Normal', 'Normal'])

In [130]:
df

   Peso  Altura  Idade        IMC Classificação
0    72     180     26  22.222222        Normal
1    80     170     19  27.681661        Normal
2    60     165     15  22.038567           NaN

### Resetar os Índices e definir indices

In [133]:
df.reset_index(inplace=True) # Parâmetro inplace faz com que o reset altere na própria variável

In [134]:
df['Nomes'] = pd.Series(['João', 'André', 'Luana'])

In [137]:
df

   level_0  index  Peso  Altura  Idade        IMC Classificação  Nomes
0        0      0    72     180     26  22.222222        Normal   João
1        1      1    80     170     19  27.681661        Normal  André
2        2      2    60     165     15  22.038567           NaN  Luana

In [138]:
df.set_index('Nomes')

       level_0  index  Peso  Altura  Idade        IMC Classificação
Nomes
João         0      0    72     180     26  22.222222        Normal
André        1      1    80     170     19  27.681661        Normal
Luana        2      2    60     165     15  22.038567           NaN

### Carregando arquivos CSV

In [146]:
df = pd.read_csv('../data_sets/titanic_train.csv', sep=',')

In [148]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [150]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [155]:
df.columns #Traz o indice das colunas

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [157]:
df.values #Traz os valores em matriz

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

In [158]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [159]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [160]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [163]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [165]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [167]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 66.2+ KB

In [171]:
df.rename(columns={'Age':'Idade', 'Name':'Nome'}, index={0:'A'})

,PassengerId,Survived,Pclass,Nome,Sex,Idade,SibSp,Parch,Ticket,Fare,Cabin,Embarked
A,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [174]:
df.duplicated() #Retorna qual linhas estão duplicados

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [176]:
df[df.duplicated()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [178]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [179]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64